app/Controllers/Laporan.php

    public function index()
    {
        //cek apakah ada session bernama isLogin
        if (!$this->session->has('isLogin')) {
            return redirect()->to('/auth/login');
        }

        $penduduk = $this->Mod_penduduk->findAll();
---
SELECT *
FROM `penduduk`