app/Controllers/Pindah.php

    public function index()
    {
        //cek apakah ada session bernama isLogin
        if (!$this->session->has('isLogin')) {
            return redirect()->to('/auth/login');
        }
        $penduduk = $this->Mod_penduduk->findAll();

        $var = $this->Mod_datang
            ->join('penduduk', 'skdatang.id_penduduk = penduduk.id_penduduk')
            ->findAll();
---
SELECT *
FROM `penduduk`
SELECT *
FROM `skdatang`
JOIN `penduduk` ON `skdatang`.`id_penduduk` = `penduduk`.`id_penduduk`